Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM306.h
#define _AD2CSSL_CSS6_POSITION                   0x00000006
#define _AD2CSSL_CSS6_MASK                       0x00000040
#define _AD2CSSL_CSS6_LENGTH                     0x00000001

#define _AD2CSSL_CSS7_POSITION                   0x00000007
#define _AD2CSSL_CSS7_MASK                       0x00000080
#define _AD2CSSL_CSS7_LENGTH                     0x00000001

#define _AD2CSSL_CSS8_POSITION                   0x00000008
#define _AD2CSSL_CSS8_MASK                       0x00000100
#define _AD2CSSL_CSS8_LENGTH                     0x00000001

#define _AD2CSSL_CSS9_POSITION                   0x00000009
#define _AD2CSSL_CSS9_MASK                       0x00000200
#define _AD2CSSL_CSS9_LENGTH                     0x00000001

#define _AD2CSSL_CSS10_POSITION                  0x0000000A
#define _AD2CSSL_CSS10_MASK                      0x00000400
#define _AD2CSSL_CSS10_LENGTH                    0x00000001

#define _AD2CSSL_CSS11_POSITION                  0x0000000B
#define _AD2CSSL_CSS11_MASK                      0x00000800
#define _AD2CSSL_CSS11_LENGTH                    0x00000001

#define _AD2CSSL_CSS12_POSITION                  0x0000000C
#define _AD2CSSL_CSS12_MASK                      0x00001000
#define _AD2CSSL_CSS12_LENGTH                    0x00000001

#define _AD2CSSL_CSS13_POSITION                  0x0000000D
#define _AD2CSSL_CSS13_MASK                      0x00002000
#define _AD2CSSL_CSS13_LENGTH                    0x00000001

#define _AD2CSSL_CSS14_POSITION                  0x0000000E
#define _AD2CSSL_CSS14_MASK                      0x00004000
#define _AD2CSSL_CSS14_LENGTH                    0x00000001

#define _AD2CSSL_CSS15_POSITION                  0x0000000F
#define _AD2CSSL_CSS15_MASK                      0x00008000
#define _AD2CSSL_CSS15_LENGTH                    0x00000001

#define _AD2CON4_DMABL_POSITION                  0x00000000
#define _AD2CON4_DMABL_MASK                      0x00000007
#define _AD2CON4_DMABL_LENGTH                    0x00000003

#define _AD2CON4_ADDMAEN_POSITION                0x00000008
#define _AD2CON4_ADDMAEN_MASK                    0x00000100
#define _AD2CON4_ADDMAEN_LENGTH                  0x00000001

#define _AD2CON4_DMABL0_POSITION                 0x00000000
#define _AD2CON4_DMABL0_MASK                     0x00000001
#define _AD2CON4_DMABL0_LENGTH                   0x00000001

#define _AD2CON4_DMABL1_POSITION                 0x00000001
#define _AD2CON4_DMABL1_MASK                     0x00000002
#define _AD2CON4_DMABL1_LENGTH                   0x00000001

#define _AD2CON4_DMABL2_POSITION                 0x00000002
#define _AD2CON4_DMABL2_MASK                     0x00000004
#define _AD2CON4_DMABL2_LENGTH                   0x00000001

#define _QEI2CON_CCM_POSITION                    0x00000000
#define _QEI2CON_CCM_MASK                        0x00000003
#define _QEI2CON_CCM_LENGTH                      0x00000002

#define _QEI2CON_GATEN_POSITION                  0x00000002
#define _QEI2CON_GATEN_MASK                      0x00000004
#define _QEI2CON_GATEN_LENGTH                    0x00000001

#define _QEI2CON_CNTPOL_POSITION                 0x00000003
#define _QEI2CON_CNTPOL_MASK                     0x00000008
#define _QEI2CON_CNTPOL_LENGTH                   0x00000001

#define _QEI2CON_INTDIV_POSITION                 0x00000004
#define _QEI2CON_INTDIV_MASK                     0x00000070
#define _QEI2CON_INTDIV_LENGTH                   0x00000003

#define _QEI2CON_IMV_POSITION                    0x00000008
#define _QEI2CON_IMV_MASK                        0x00000300
#define _QEI2CON_IMV_LENGTH                      0x00000002

#define _QEI2CON_PIMOD_POSITION                  0x0000000A
#define _QEI2CON_PIMOD_MASK                      0x00001C00
#define _QEI2CON_PIMOD_LENGTH                    0x00000003

#define _QEI2CON_QEISIDL_POSITION                0x0000000D
#define _QEI2CON_QEISIDL_MASK                    0x00002000
#define _QEI2CON_QEISIDL_LENGTH                  0x00000001

#define _QEI2CON_QEIEN_POSITION                  0x0000000F
#define _QEI2CON_QEIEN_MASK                      0x00008000
#define _QEI2CON_QEIEN_LENGTH                    0x00000001

#define _QEI2IOC_QEA_POSITION                    0x00000000
#define _QEI2IOC_QEA_MASK                        0x00000001
#define _QEI2IOC_QEA_LENGTH                      0x00000001

#define _QEI2IOC_QEB_POSITION                    0x00000001
#define _QEI2IOC_QEB_MASK                        0x00000002
#define _QEI2IOC_QEB_LENGTH                      0x00000001

#define _QEI2IOC_INDEX_POSITION                  0x00000002
#define _QEI2IOC_INDEX_MASK                      0x00000004
#define _QEI2IOC_INDEX_LENGTH                    0x00000001

#define _QEI2IOC_HOME_POSITION                   0x00000003
#define _QEI2IOC_HOME_MASK                       0x00000008
#define _QEI2IOC_HOME_LENGTH                     0x00000001

#define _QEI2IOC_QEAPOL_POSITION                 0x00000004
#define _QEI2IOC_QEAPOL_MASK                     0x00000010
#define _QEI2IOC_QEAPOL_LENGTH                   0x00000001

#define _QEI2IOC_QEBPOL_POSITION                 0x00000005
#define _QEI2IOC_QEBPOL_MASK                     0x00000020
#define _QEI2IOC_QEBPOL_LENGTH                   0x00000001

#define _QEI2IOC_IDXPOL_POSITION                 0x00000006
#define _QEI2IOC_IDXPOL_MASK                     0x00000040
#define _QEI2IOC_IDXPOL_LENGTH                   0x00000001

#define _QEI2IOC_HOMPOL_POSITION                 0x00000007
#define _QEI2IOC_HOMPOL_MASK                     0x00000080
#define _QEI2IOC_HOMPOL_LENGTH                   0x00000001

#define _QEI2IOC_SWPAB_POSITION                  0x00000008
#define _QEI2IOC_SWPAB_MASK                      0x00000100
#define _QEI2IOC_SWPAB_LENGTH                    0x00000001

#define _QEI2IOC_OUTFNC_POSITION                 0x00000009
#define _QEI2IOC_OUTFNC_MASK                     0x00000600
#define _QEI2IOC_OUTFNC_LENGTH                   0x00000002

#define _QEI2IOC_QFDIV_POSITION                  0x0000000B
#define _QEI2IOC_QFDIV_MASK                      0x00003800
#define _QEI2IOC_QFDIV_LENGTH                    0x00000003

#define _QEI2IOC_FLTREN_POSITION                 0x0000000E
#define _QEI2IOC_FLTREN_MASK                     0x00004000
#define _QEI2IOC_FLTREN_LENGTH                   0x00000001

#define _QEI2IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI2IOC_QCAPEN_MASK                     0x00008000
#define _QEI2IOC_QCAPEN_LENGTH                   0x00000001

